Revit 2024 API
AnalyticalElement.IsValidStructuralRole Method
 Checks whether the value set for Analytical Structural Role is valid for an Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool IsValidStructuralRole(
	AnalyticalStructuralRole structuralRole
)
Visual Basic
Public Function IsValidStructuralRole ( _
	structuralRole As AnalyticalStructuralRole _
) As Boolean
Visual C++
public:
bool IsValidStructuralRole(
	AnalyticalStructuralRole structuralRole
)
Parameters
structuralRole
Type: Autodesk.Revit.DB.Structure.AnalyticalStructuralRole
 The value set to be verified.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace